[Killed] ConditionalExpression
main/components/Requests/RecommendationRequestForm.js:91:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterName && "Requester Name is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Requester Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Requests/RecommendationRequestForm.js:108:28
               id="recommendationTypes"
               type="string"
               isInvalid={Boolean(errors.recommendationTypes)}
-              {...register("recommendationTypes", {})}
+              {...register("", {})}
             >
               <option value="CS Department BS/MS program">
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
