[Killed] ArrowFunction
main/pages/Requests/RequestEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (request) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: request.id,
-    },
-    data: {
-      professorName: request.professorName,
-      professorEmail: request.professorEmail,
-      requesterName: request.requesterName,
-      submissionDate: new Date().toISOString(), // gets current date
-      status: "PENDING",
-      details: request.recommendationTypes !== "Other" ? request.details : "", // in the case that Other is not selected
-      recommendationTypes:
-        request.recommendationTypes === "Other"
-          ? request.details
-          : request.recommendationTypes,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (request) => {
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Requests/RequestEditPage.js:28:48
     },
   );
 
-  const objectToAxiosPutParams = (request) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: request.id,
-    },
-    data: {
-      professorName: request.professorName,
-      professorEmail: request.professorEmail,
-      requesterName: request.requesterName,
-      submissionDate: new Date().toISOString(), // gets current date
-      status: "PENDING",
-      details: request.recommendationTypes !== "Other" ? request.details : "", // in the case that Other is not selected
-      recommendationTypes:
-        request.recommendationTypes === "Other"
-          ? request.details
-          : request.recommendationTypes,
-    },
-  });
+  const objectToAxiosPutParams = (request) => ({});
 
   const onSuccess = (request) => {
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Requests/RequestEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (request) => ({
-    url: "/api/recommendationrequest",
+    url: "",
     method: "PUT",
     params: {
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ConditionalExpression
main/pages/Requests/RequestEditPage.js:40:16
       requesterName: request.requesterName,
       submissionDate: new Date().toISOString(), // gets current date
       status: "PENDING",
-      details: request.recommendationTypes !== "Other" ? request.details : "", // in the case that Other is not selected
+      details: false ? request.details : "", // in the case that Other is not selected
       recommendationTypes:
         request.recommendationTypes === "Other"
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided without Other
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 400"
       2: "Error: Request failed with status code 400"

Number of calls: 2

[Killed] EqualityOperator
main/pages/Requests/RequestEditPage.js:40:16
       requesterName: request.requesterName,
       submissionDate: new Date().toISOString(), // gets current date
       status: "PENDING",
-      details: request.recommendationTypes !== "Other" ? request.details : "", // in the case that Other is not selected
+      details: request.recommendationTypes === "Other" ? request.details : "", // in the case that Other is not selected
       recommendationTypes:
         request.recommendationTypes === "Other"
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 400"
       2: "Error: Request failed with status code 400"

Number of calls: 2

[Killed] EqualityOperator
main/pages/Requests/RequestEditPage.js:42:9
       status: "PENDING",
       details: request.recommendationTypes !== "Other" ? request.details : "", // in the case that Other is not selected
       recommendationTypes:
-        request.recommendationTypes === "Other"
+        request.recommendationTypes !== "Other"
           ? request.details
           : request.recommendationTypes,
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 400"
       2: "Error: Request failed with status code 400"

Number of calls: 2

[Killed] ConditionalExpression
main/pages/Requests/RequestEditPage.js:42:9
       status: "PENDING",
       details: request.recommendationTypes !== "Other" ? request.details : "", // in the case that Other is not selected
       recommendationTypes:
-        request.recommendationTypes === "Other"
+        false
           ? request.details
           : request.recommendationTypes,
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Request Updated - id: 17 professor name: testnameother professorEmail: testnameotheremail@ucsb.edu requester name: testname2"
Received
       1: "Axios Error: Error: Request failed with status code 400"
       2: "Error: Request failed with status code 400"

Number of calls: 2

[Killed] BlockStatement
main/pages/Requests/RequestEditPage.js:48:34
     },
   });
 
-  const onSuccess = (request) => {
-    toast(
-      `Request Updated - id: ${request.id} professor name: ${request.professorName} professorEmail: ${request.professorEmail} requester name: ${request.requesterName}`,
-    );
-  };
+  const onSuccess = (request) => {};
 
   const mutation = useBackendMutation(
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Requests/RequestEditPage.js:67:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/requests/statistics" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/requests/statistics"}

Number of calls: 0
