[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:76:16
               ) : (
                 <></>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <Nav.Link as={Link} to="/requests/pending">
-                    Pending Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/completed">
-                    Completed Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/statistics">
-                    Statistics
-                  </Nav.Link>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <>
+                  <Nav.Link as={Link} to="/requests/pending">
+                    Pending Requests
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/requests/completed">
+                    Completed Requests
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/requests/statistics">
+                    Statistics
+                  </Nav.Link>
+                </>}
             </Nav>
 
killedBy: AppNavbar tests renders the three prof pages correctly for admin users
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
