[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:37:41
         console.error("Error fetching professors");
       }
     };
-    const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttype/all");
-        const data = await response.json();
-        setRecommendationTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
-    };
+    const getRequestTypes = async () => {};
 
     getProfessors();
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 510

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:38:11
       }
     };
     const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttype/all");
-        const data = await response.json();
-        setRecommendationTypes(data);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching request types");
       }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/requesttype/all"
Received
       1: "/api/admin/users/professors"
       2: "/api/admin/users/professors"
       3: "/api/admin/users/professors"

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:49:9
 
     getProfessors();
     getRequestTypes();
-    if (professors === undefined || professors.length === 0) {
+    if (professors !== undefined || professors.length === 0) {
       setProfessors(professorVals);
     }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: Craig Zzyxx. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:49:9
 
     getProfessors();
     getRequestTypes();
-    if (professors === undefined || professors.length === 0) {
+    if (true) {
       setProfessors(professorVals);
     }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: Craig Zzyxx. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:52:46
     if (professors === undefined || professors.length === 0) {
       setProfessors(professorVals);
     }
-    if (recommendationTypes === undefined || recommendationTypes.length === 0) {
+    if (recommendationTypes === undefined || recommendationTypes.length !== 0) {
       setRecommendationTypes(recommendationTypeVals);
     }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: CS Department BS/MS program. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:52:9
     if (professors === undefined || professors.length === 0) {
       setProfessors(professorVals);
     }
-    if (recommendationTypes === undefined || recommendationTypes.length === 0) {
+    if (true) {
       setRecommendationTypes(recommendationTypeVals);
     }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: CS Department BS/MS program. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:133:27
               type="string"
               isInvalid={Boolean(errors.recommendationType)}
               {...register("recommendationType", {
-                required: "Please select a recommendation type",
+                required: "",
               })}
               defaultValue=""
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
