[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:15:34
 export default function RecommendationRequestTable({ requests, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/requests/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requests/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:40:17
     },
     {
       Header: "Professor Name",
-      accessor: "professorName",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professorName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:42:5
       Header: "Professor Name",
       accessor: "professorName",
     },
-    {
-      Header: "Professor Email",
-      accessor: "professorEmail",
-    },
+    {},
     {
       Header: "Requester Name",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:46:5
       Header: "Professor Email",
       accessor: "professorEmail",
     },
-    {
-      Header: "Requester Name",
-      accessor: "requesterName",
-    },
+    {},
     {
       Header: "Recommendation Types",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:47:15
       accessor: "professorEmail",
     },
     {
-      Header: "Requester Name",
+      Header: "",
       accessor: "requesterName",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requester Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:50:5
       Header: "Requester Name",
       accessor: "requesterName",
     },
-    {
-      Header: "Recommendation Types",
-      accessor: "recommendationTypes",
-    },
+    {},
     {
       Header: "Details",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:55:15
       accessor: "recommendationTypes",
     },
     {
-      Header: "Details",
+      Header: "",
       accessor: "details",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:66:5
       Header: "Submission Date",
       accessor: "submissionDate",
     },
-    {
-      Header: "Completion Date",
-      accessor: "completionDate",
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:67:15
       accessor: "submissionDate",
     },
     {
-      Header: "Completion Date",
+      Header: "",
       accessor: "completionDate",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Completion Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:68:17
     },
     {
       Header: "Completion Date",
-      accessor: "completionDate",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-completionDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:72:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:76:9
     columns.push(
       ButtonColumn(
         "Edit",
-        "primary",
+        "",
         editCallback,
         "RecommendationRequestTable",
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:78:9
         "Edit",
         "primary",
         editCallback,
-        "RecommendationRequestTable",
+        "",
       ),
     );
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:86:9
         "Delete",
         "danger",
         deleteCallback,
-        "RecommendationRequestTable",
+        "",
       ),
     );
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
