[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:13:30
 export default function RecommendationRequestIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/requests/create"
-          style={{ float: "right" }}
-        >
-          Create Recommendation Request
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
